Revit 2027 API
ParameterTypeId.ViewSolarstudyCurrentStudyTypeIndex Property
 "Study type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewSolarstudyCurrentStudyTypeIndex { get; }
Public Shared ReadOnly Property ViewSolarstudyCurrentStudyTypeIndex As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewSolarstudyCurrentStudyTypeIndex {
	ForgeTypeId^ get ();
}
static member ViewSolarstudyCurrentStudyTypeIndex : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace